# ðŸ“Š EDA â€“ Exploratory Data Analysis
World Cup Holistic Impact Project

### Introduction
L'objectif de cette EDA est d'explorer les indicateurs Ã©conomiques, sociaux, environnementaux et urbains des pays hÃ´tes avant et aprÃ¨s la Coupe du Monde, afin d'identifier les tendances et impacts significatifs

###  Importation des librairies

In [1]:
import pandas as pd
import numpy as np

### Chargement des datasets

In [2]:
dfEco=pd.read_csv('../Data Collection/economic_world_cup_data.csv')
dfEnv=pd.read_csv('../Data Collection/environmental_world_cup_data.csv')
dfSoc=pd.read_csv('../Data Collection/social_indicators.csv')
dfUrb=pd.read_csv('../Data Collection/urban_infrastructure_data.csv')
dfWhr=pd.read_csv('../Data Collection/WHR.csv',sep=';')
dfFifa=pd.read_csv('../Data Collection/worldCupData.csv')

## EDA DataEco

In [3]:
dfEco.head()

,Country,Year,GDP_Growth,Inflation,FDI,Tourist_Arrivals,POP,Employment
0,BRA,2003,1.140829,14.714920,1.012301e+10,4133000.0,180622688.0,59.427
1,BRA,2004,5.759965,6.597185,1.816138e+10,4794000.0,182675143.0,60.579
2,BRA,2005,3.202132,6.869537,1.545998e+10,5358000.0,184688101.0,60.870
3,BRA,2006,3.961989,4.183568,1.941809e+10,5017000.0,186653106.0,61.143
4,BRA,2007,6.069871,3.641273,4.457949e+10,5026000.0,188552320.0,61.050

In [6]:
dfEco.shape

(110, 8)

In [4]:
dfEco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Country           110 non-null    object
 1   Year              110 non-null    int64
 2   GDP_Growth        110 non-null    float64
 3   Inflation         110 non-null    float64
 4   FDI               110 non-null    float64
 5   Tourist_Arrivals  83 non-null     float64
 6   POP               110 non-null    float64
 7   Employment        110 non-null    float64
dtypes: float64(6), int64(1), object(1)
memory usage: 7.0+ KB

In [5]:
dfEco.describe()

,Year,GDP_Growth,Inflation,FDI,Tourist_Arrivals,POP,Employment
count,110.000000,110.000000,110.000000,1.100000e+02,8.300000e+01,1.100000e+02,110.000000
mean,2013.500000,3.199902,5.008310,3.339614e+10,1.520268e+07,9.642152e+07,60.399891
std,6.373325,4.991717,3.962753,3.880251e+10,1.110823e+07,6.899670e+07,14.276435
min,2003.000000,-7.799994,-4.863278,-3.980094e+10,5.820000e+05,7.446820e+05,36.798000
25%,2008.000000,0.886090,2.258515,2.663388e+09,5.395500e+06,5.126808e+07,53.989750
50%,2013.500000,2.641687,4.514282,1.643239e+10,1.306900e+07,8.242294e+07,58.335000
75%,2019.000000,4.686204,6.836878,6.266752e+10,2.430500e+07,1.447222e+08,60.577750
max,2024.000000,26.170246,15.534396,1.767810e+11,3.956300e+07,2.119986e+08,87.461000

In [3]:
dfEco.value_counts('Country')

Country
BRA    22
DEU    22
QAT    22
RUS    22
ZAF    22
Name: count, dtype: int64

## EDA DataEnv

In [4]:
dfEnv.head()

,Country,Year,Air_transport_passengers,Energy_Use_per_capita,Renewable_Energy_pct
0,BRA,2003,32372040.0,1107.973916,45.1
1,BRA,2004,35263795.0,1157.169056,45.2
2,BRA,2005,37661733.0,1173.715857,46.1
3,BRA,2006,40945038.0,1202.059339,46.7
4,BRA,2007,45286990.0,1259.911360,47.2

In [5]:
dfEnv.shape

(110, 5)

In [6]:
dfEnv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Country                   110 non-null    object
 1   Year                      110 non-null    int64
 2   Air_transport_passengers  84 non-null     float64
 3   Energy_Use_per_capita     103 non-null    float64
 4   Renewable_Energy_pct      95 non-null     float64
dtypes: float64(3), int64(1), object(1)
memory usage: 4.4+ KB

In [7]:
dfEnv.describe()

,Year,Air_transport_passengers,Energy_Use_per_capita,Renewable_Energy_pct
count,110.000000,8.400000e+01,103.000000,95.000000
mean,2013.500000,6.117084e+07,5902.297633,14.156842
std,6.373325,3.686127e+07,5981.571312,16.623770
min,2003.000000,8.304771e+06,1107.973916,0.000000
25%,2008.000000,2.548393e+07,2208.394261,3.200000
50%,2013.500000,6.325988e+07,3794.447203,8.300000
75%,2019.000000,9.697151e+07,5024.544031,14.900000
max,2024.000000,1.172228e+08,21557.475076,50.000000

In [4]:
dfEnv.value_counts('Country')

Country
BRA    22
DEU    22
QAT    22
RUS    22
ZAF    22
Name: count, dtype: int64

## EDA DataSoc

In [8]:
dfSoc.head()

  Country  Year  GDP_per_capita  Crime_rate  Participation_rate
0     BRA  2003     3090.606891   28.271088              66.899
1     BRA  2004     3663.822625   26.491836              67.364
2     BRA  2005     4827.781659   25.769392              68.050
3     BRA  2006     5934.145619   26.340306              67.705
4     BRA  2007     7409.690038   25.314459              67.295

In [9]:
dfSoc.shape

(110, 5)

In [10]:
dfSoc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Country             110 non-null    object
 1   Year                110 non-null    int64
 2   GDP_per_capita      110 non-null    float64
 3   Crime_rate          100 non-null    float64
 4   Participation_rate  110 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 4.4+ KB

In [11]:
dfSoc.describe()

              Year  GDP_per_capita  Crime_rate  Participation_rate
count   110.000000      110.000000  100.000000          110.000000
mean   2013.500000    28632.701127   15.392538           66.178555
std       6.373325    27646.181935   14.270879           10.419012
min    2003.000000     2975.123047    0.069145           54.171000
25%    2008.000000     7351.163515    0.870285           59.950500
50%    2013.500000    12350.011730   11.425943           62.016000
75%    2019.000000    47571.950504   28.642485           67.104500
max    2024.000000   108470.387023   43.720255           87.575000

In [5]:
dfSoc.value_counts('Country')

Country
BRA    22
DEU    22
QAT    22
RUS    22
ZAF    22
Name: count, dtype: int64

## EDA DataUrb

In [12]:
dfUrb.head()

,Country,Year,Infra_invest_%GDP,Urban_population_%,Internet_users_%,Mobile_subscriptions
0,BRA,2003,16.856688,82.354034,13.2076,25.6741
1,BRA,2004,17.912568,82.681682,19.0737,35.9135
2,BRA,2005,17.204883,82.983880,21.0227,46.6789
3,BRA,2006,17.816474,83.267210,28.1784,53.5317
4,BRA,2007,19.819326,83.538257,30.8800,64.1626

In [13]:
dfUrb.shape

(110, 6)

In [14]:
dfUrb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Country               110 non-null    object
 1   Year                  110 non-null    int64
 2   Infra_invest_%GDP     108 non-null    float64
 3   Urban_population_%    110 non-null    float64
 4   Internet_users_%      108 non-null    float64
 5   Mobile_subscriptions  105 non-null    float64
dtypes: float64(4), int64(1), object(1)
memory usage: 5.3+ KB

In [15]:
dfUrb.describe()

,Year,Infra_invest_%GDP,Urban_population_%,Internet_users_%,Mobile_subscriptions
count,110.000000,108.000000,110.000000,108.000000,105.000000
mean,2013.500000,22.931381,80.202100,61.160080,119.364980
std,6.373325,7.867519,12.091375,28.261456,36.193636
min,2003.000000,12.345544,58.372434,7.007690,24.785000
25%,2008.000000,18.388028,73.493902,40.292500,98.645600
50%,2013.500000,20.872846,80.524486,69.150000,126.132000
75%,2019.000000,23.493561,86.620367,84.226050,147.358000
max,2024.000000,48.869083,99.321989,99.652800,180.842000

In [6]:
dfUrb.value_counts('Country')

Country
BRA    22
DEU    22
QAT    22
RUS    22
ZAF    22
Name: count, dtype: int64

## EDA DataWhr

In [21]:
dfWhr.head()

   Year Country name  Life_Satisfaction
0  2024       Brazil              6.494
1  2023       Brazil              6.272
2  2022       Brazil              6.125
3  2021       Brazil              6.293
4  2020       Brazil              6.330

In [22]:
dfWhr.shape

(79, 3)

In [23]:
dfWhr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79 entries, 0 to 78
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Year               79 non-null     int64
 1   Country name       79 non-null     object
 2   Life_Satisfaction  79 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.0+ KB

In [24]:
dfWhr.describe()

              Year  Life_Satisfaction
count    79.000000          79.000000
mean   2016.291139           6.132975
std       5.430569           0.771666
min    2003.000000           4.459000
25%    2012.000000           5.461500
50%    2017.000000           6.374000
75%    2021.000000           6.751500
max    2025.000000           7.155000

In [8]:
dfWhr.value_counts('Country name')

Country name
Germany         20
South Africa    18
Brazil          14
Qatar           14
Russian         13
Name: count, dtype: int64

## EDA DataFIFA

In [25]:
dfFifa.head()

,Edition,Country,Stadium_Count,Stadium_Cost_USD_Billion,Total_Budget_USD_Billion,Key_Infrastructures,Economic_Impact_USD_Billion,Jobs_Created,Legacy_Issues
0,2006,Germany,12,1.60,4.3,"Transport, Telecoms, Security",0.0,0,"Stadiums well used by clubs, limited local eco..."
1,2010,South Africa,10,1.30,4.5,"Airports, Roads, Telecoms, Energy",3.1,130000,"Underutilized stadiums, high maintenance costs"
2,2014,Brazil,12,4.80,15.7,"Airports, Urban mobility, Telecoms, Ports",13.6,1000000,"Low project execution, white elephants, social..."
3,2018,Russia,12,4.22,11.0,"Airports, Roads, Metro, Hospitals, Hotels",13.8,220000,"Durable infrastructures, stadiums reused"
4,2022,Qatar,8,4.30,220.0,"Metro, Roads, Lusail city, Energy, Hotels",20.0,1500000,"Massive legacy, profitability and sustainabili..."

In [26]:
dfFifa.shape

(5, 9)

In [27]:
dfFifa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Edition                      5 non-null      int64
 1   Country                      5 non-null      object
 2   Stadium_Count                5 non-null      int64
 3   Stadium_Cost_USD_Billion     5 non-null      float64
 4   Total_Budget_USD_Billion     5 non-null      float64
 5   Key_Infrastructures          5 non-null      object
 6   Economic_Impact_USD_Billion  5 non-null      float64
 7   Jobs_Created                 5 non-null      int64
 8   Legacy_Issues                5 non-null      object
dtypes: float64(3), int64(3), object(3)
memory usage: 492.0+ bytes

In [28]:
dfFifa.describe()

,Edition,Stadium_Count,Stadium_Cost_USD_Billion,Total_Budget_USD_Billion,Economic_Impact_USD_Billion,Jobs_Created
count,5.000000,5.000000,5.000000,5.00000,5.000000,5.000000e+00
mean,2014.000000,10.800000,3.244000,51.10000,10.100000,5.700000e+05
std,6.324555,1.788854,1.656104,94.53859,8.290959,6.501538e+05
min,2006.000000,8.000000,1.300000,4.30000,0.000000,0.000000e+00
25%,2010.000000,10.000000,1.600000,4.50000,3.100000,1.300000e+05
50%,2014.000000,12.000000,4.220000,11.00000,13.600000,2.200000e+05
75%,2018.000000,12.000000,4.300000,15.70000,13.800000,1.000000e+06
max,2022.000000,12.000000,4.800000,220.00000,20.000000,1.500000e+06

In [9]:
dfFifa.value_counts('Country')

Country
Brazil          1
Germany         1
Qatar           1
Russia          1
South Africa    1
Name: count, dtype: int64